In [10]:
# Import required libraries
import pandas as pd
import missingno as msno

#### Mine Dataset(mine.csv)

In [11]:
# Loading the dataset
df_mine = pd.read_csv('./mine.csv')

In [12]:
# Using the head() function to display the few first rows of the dataset
df_mine.head()

     Name         city  age py-score
0    Emma      Kampala   23       90
1  Wilber        Mbale   26       75
2   Robin         Gulu   25     mine
3   Tevor  Livingstone  NaN       89
4    Yeko       Tororo   20       94

In [13]:
# Using the tail() function to display the few last rows of the dtaset
df_mine.tail()

     Name         city    age py-score
2   Robin         Gulu     25     mine
3   Tevor  Livingstone    NaN       89
4    Yeko       Tororo     20       94
5  Miriam         Arua  Train      NaN
6   Jesca      Mbarara     21       84

In [14]:
# Using the info() function to get information about the dataset
df_mine.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 169 entries, 0 to 168
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  169 non-null    int64
 1   Pulse     169 non-null    int64
 2   Maxpulse  169 non-null    int64
 3   Calories  164 non-null    float64
dtypes: float64(1), int64(3)
memory usage: 5.4 KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      7 non-null      object
 1   city      7 non-null      object
 2   age       6 non-null      object
 3   py-score  6 non-null      object
dtypes: object(4)
memory usage: 356.0+ bytes

In [15]:
df_mine.duplicated().sum()

     Name     city age py-score
0    Emma  Kampala  23       90
1  Wilber    Mbale  26       75
2   Robin     Gulu  25     mine
4    Yeko   Tororo  20       94
6   Jesca  Mbarara  21       84

In [16]:
df_mine.describe().T

KeyboardInterrupt

In [ ]:
df_mine.isnull().sum().sort_values(ascending = False)

In [ ]:
for i in df_mine.columns:
    if df_mine[i].isnull().any():
        print(i, "------", df_mine[i].isnull().sum()*100/df_mine.shape[0], "%")

In [ ]:
#Using drop_duplicates() to remove duplicates
df_mine.drop_duplicates(inplace = True)

In [ ]:
#Reomoving rows with Null values
df_mine.dropna(inplace = True)

In [ ]:
df_mine.corr()

#### Work Dataset(Work.csv)

In [ ]:
df_work = pd.read_csv("./Work.csv")
df_work.info()

In [ ]:
df_work.describe(include = 'object').T

In [ ]:
df_work.head()

In [ ]:
df_work.tail()

In [ ]:
df_work.isnull().sum().sort_values(ascending = False)

In [ ]:
df_work.duplicated().sum()

In [ ]:
msno.bar(df_work, color = "grey", fontsize= 12)

In [ ]:
for i in df_work.columns:
    if df_work[i].isnull().any():
        print(i, "------", df_work[i].isnull().sum()*100/df_work.shape[0], "%")

In [ ]:
df_work['age'] = pd.to_numeric(df_work['age'], errors='coerce')
df_work['age'] = df_work['age'].astype('Int64')
df_work['py-score'] = pd.to_numeric(df_work['py-score'], errors='coerce')
df_work['py-score'] = df_work['py-score'].astype('Int64')
mean_age = df_work['age'].mean(skipna=True)
mean_py_score = df_work['py-score'].mean(skipna=True)

print("Mean Age:", mean_age)
print("Mean Py-Score:", mean_py_score)

In [ ]:
# Check the dataset again
df_work

In [ ]:
# Drop the row with 'Livingstone' as the city
df_work = df_work[df_work['city'] != 'Livingstone']

# Reset the index of the DataFrame
df_work.reset_index(drop=True, inplace=True)
df_work

In [ ]:
# Replace null values in the 'age' column with a mean value
df_work['age'].fillna(value=23, inplace=True)

# Replace null values in the 'age' column with a mean value
df_work['py-score'].fillna(value=86, inplace=True)

df_work

In [ ]:
# Perform correlation
correlation = df_work[['age', 'py-score']].corr()

# Print the correlation matrix
print("Correlation Matrix:")
print(correlation)